[{"title":"Avatar","comments":["I am sorry for you... The technology of 3D movie was ill-conceived and movie directors had no idea how human stereoscopic vision works... To make things catastrophic, James Cameron created the worst 3D movie ever... Yes, the Avatar was totally stripped of billions of stereoscopic specular effects making all the scenes as if they ware colored paper textures...\n\nTo completely confuse viewers brain he made the actors and the scene grow or shrink during a single take and there is not a single scene in which actors would have their original size...\n\nSo, it is 2019 and not a single person in the World has seen real 3D movie!\n\nExcept for me :-)\n\nI will be making some serious money on Indiegogo selling 3D vision equipment and the first ever real 3D movie...\n\nSee you there and all the best in your life...\n\nMathew Orman","This was the ONLY preview I needed to see. I swore I wouldn't watch another until it came it. I nearly ORGASMED when my wife and I watched it in 3D...yes she was sucking me Popcorn style. God but people are so rude to stare.","Ahahahahahahahahahahaha!  You MUST be daft.  Titanic's \"story\" is so insipid that there aren't words to describe how painfully trite of a movie that was compared to Avatar.  And I, for one, consider it one of DiCaprio’s worst and most heavy handed performances… much due to the horrible lines he was given in that forgettable script.","A box office success does not indicate quality of a film.  It indicates statistics like marketing, audience, time of release, and other factors.  Avatar was released just as Titanic was: In the winter, little competition, which led to repeat viewings.  Titanic, however, was far superior to Avatar.","аватар гавно для пидоров","What is this music? Source anyone?","THE PLOT WAS A BIG CLICHE, NOW EVERYBODY SHUT UP AND ENJOY THE AMAZING VISUALS, I WANT TO ENJOY THE AMAZING VISUALS, FUCK.","I really do understand you, but you can enjoy the movie if you don't care about the story too much, because the visuals are amazing.","@haydenworley Actually, it's almost scene for scene a remake of the Don Rosa story \"War of the Wendigo\". Love subplot aside. Right down to the placement of key scenes like the bulldozer attack and the final battle.","@Avatard168 Im just saying, dark knight ratings beat avatar ratings by ten fold.","@Johnlindsey289 If it was the next gone with the wind it would have a good story and better ratings. The movie itself only holds an average of 88% on rotten tomatoes.","@Avatard168 The dark knight alone, was better then avatar...","@Johnlindsey289 Get some good taste in movies buddy: Godfather, citizen kane, 2001 a space oddyssey, full metal jacket, Black swan, the fountain, Moon, A clockwork orange, Eraserhead, Mulholland drive, Primer, The wrestler, No country for old men, ETC.","@Johnlindsey289 Avatar has nothing mature about it, Its an environmental film. Avatar is the highest grossing film, But highest rated? Not even close. in the list of highest rated sci fi films district 9 stands far above avatar. District 9 had a small budget, and made 100% use of it. District 9 has beteer pacing more original story and more interesting people. Also the message district 9 gives you is better then avatars. Aliens is better then avatar,","@Johnlindsey289 Look, Avatar is overhyped/overrated. People were suckered into a film that had just a bunch of special effects innovation. But it had a mediocre/predictable story, sometimes the acting was bad too. The film also had bad pacing. And did not need to be 3 hours long. Even the dark knight was better then avatar. Dark knight had perfect pacing, a better story, and more interesting characters. That film made you go on the edge of you're seat eager to see what was gonna happen.","Who the fuck cares if its a rip off of Pocahontas? or Ferngully, or Dances with Wolves, or the Last Samurai? And why wasn't it an issue until some guy on the internet mentioned it? A fucking 5 year old with down syndrome could've told you that months before the movie came out!","@ranamuhammadatif SHUT THE H*** UP","@ranamuhammadatif how can technology be immature?","why is no one gives fuck that\n-Goodfellas is The Godfather based on a true story?\n-Never Back Down is a modern day version of Karate Kid?\n-Reservoir Dogs ripped off a great Asian cinema classic in City on Fire?\nMaybe its because of the mind blowing special and visual effects, the satirical stance on corporate America or the fact it raked in 2 billion dollars\nWhatever the reason, Avatar is a great movie whose sceptics dont like James Cameron, not the actual movie.\nBring on Avatar 2!","Terrible movie.\nGood idea, mind-blowing univers, but ended up beeing pochahontas feats actionman, NOW WITH EXPLODING HELICOPTERS!\nTerrible terrible...\n\nIt saddens me that the wonderful idea ended up being a stupid B action film. I did expect more from cameron. ","@anonymouspoet1 and good acting","@anonymouspoet1 you forgot the part with the new planet, language, species', army, exploration, war, sacrifice and over all good ideas.","Can you say,which music plays in trailer?","The story has been done in other films/books a hundred times over. The only good thing was a bout this movie, was the cgi.","\n1 minute ago\n@Avatard 168,really good story? the story was just about as fresh as a college dude's socks...boy﻿ pretends to be what he's not.boy meets girl and they fall in love.girl finds out the truth and hates boy.some catastrophe that boy was somewhat responsible for.boy switches teams.they fall in love and live happily ever after...c'mon.let's face it, it was the graphics. if i wanted something that relates to what's happening now i'd sit on my front porch and watch my neighbours walk by","@Dc13PL what do you mean? there was barely any hype for it,  before it came out i didn't see a single commercial for it on TV, just one in the movie theartures,and  the only reason I heard about at all was because there was an article about it in a magazine about the special affects and how it took like 6 years to make.","@ConcreteSurfer420 I'm not english, i'm still learning, that's why my english is so poor.","@ConcreteSurfer420 I don't hate Avatar, i just don't find it a spectacular movie, it was nominated for all of that because the critics liked it's special effects and because of the director.","@adrianocounter  Learn how to spell!","Yea your right about Transformers 2 but it didnt win a Golden Globe for best picture and Nominated for a Best Picture Oscar like Avatar! If you and everyone else who hated Avatar got together you guys could all fit in a Mazda Miata! Transformers 2 was givin 1 star, Avatar received 4 stars! Transformers 2 made $500 million in the box office worldwide, Avatar made $2 Billion in the box office worldwide! I think its safe to say Avatar is a Great Movie! ","@ConcreteSurfer420 Because it was well promoted, the efects were inovative and don't forget that transformer 2 made a lot of money too, that didn't make it a bether film.","@adrianocounter is that why it made more money than any movie in history?","@adrianocounter is that why is made so much money?","@ConcreteSurfer420 He did it with this film.","@Snako85 LOL well at least we agree on something, sorry about the I.Q comment","The film was brillant. James Cameron took special effects to a whole new level.","@Snako85 If you hated Avatar? why did you \"choose\" to watch the trailer of a film you hated? I hate Slumdog Millionaire, but im not about to watch the trailer! You obviously have a very low I.Q LOL! watching trailers for movies you hate! WEIRDO!","Exactly which I can!..See BONERcrusher, I know you like to troll..You come on here and give a blunt insult to a movie you don't have any knowledge of..Pretty much sure you waste time talking shit on Halo Live though?!..I thought Marines did better things with there time?!..hmm, guess not?!..","Or choad .... as in a small fat penis ...","I hate when people look at trailers and already say that its gonna suck, I really don't give a damn what people say, Cameron's films are always awesome.","Okay, I'm not dissing Cameron or this movie or the effects or anything. But... I don't know... not what I expected. It feels like Apocalypto in Space.... doesn't look that original at all.","Explain to me HOW this is different from any PIXAR film? These aliens and their world look completely cartoony! Is this supposed to be somehow \"epic\" because their combining the CGI characters with live action??? They've been doing that for decades, and FAR better than this! Remember Jurassic Park?","s'not.  entirely fresh.","You haven't even seen the movie, how do you know its a waist from just watching the trailer?","No, this was an original idea. Something Hollywood lacks these days.","No..it's camerons original idea...","BONERcrusherOfBorg...\nDude In all you don't even need to come on here a voice your opinion cause nobody cares, and no you don't have a right to...What you using XBox live talk or something?..Oh, and you don't have to insult somebody cause of their age? What if he's 19?!...so..","I'll go see it, but my expectations won't be high. This isn't the second coming of the messiah!","No. It's not based on anything at all. It's entirely fresh and original.","YOU COULDN'T HAVE SAID IT ANY BETTER!"]},{"title":"Pirates of the Caribbean: At World's End","comments":["The best part of the trailer starts at 1:42 and its own climax is at 1:55, one of the best trailers I've seen along with Spider-Man 2, The Dark Knight Rises, PotC 2, The Revenge of the Sith, The Chronicles of Narnia.","I abuse this button 1:55","1:45 music?","flatearth-ers  favorite movie","My fave part","Εμείς οι τρελοί πειρατές, έχουμε μυστηκούς κώδηκες επι κοινωνίας. Αυτοί οι κώδηκες, έχουν να κάνουν, με την συμφονία λόγων και πράξεων. Μπορεί κάποιος να ψεύδετε, και με τα ρούχα που φοράει.","This movie came out like 12 freakin years ago and not only does it has one of the best trailers ever made, the CGI is still one of the most well done in any movie and it can even be compared with todays movies. Say anything you want about the plot or whatever but the techincal aspects of this movie are still top notch.","This was the last film of the franchise that was worth watching.","Anyone is 2019","Full hd movie link plzz","What power ranger is this?","The movie is okk, just not the Best in the series.  \nOn side note - search for x ray dog dark empire 2. Thank me later","1:06","Came back for a dose of nostalgia ❤","I love how most of the comments are about 1:55. And it’s also ironic that 1:55 was really the main reason why I love this movie in the first place.","1:54 best moment of the whole trailer","Rewatching this trailer just to get me hyped for Kingdom Hearts 3. 1:55 I always loved this part of the trailer.","That makes you the highest bidder","Add Dead Man's Chest Trailer","Johnny Depp, u were so hot when young","Best trailer in the history of trailers.","Can anyone give me this movie link","Best pirates movie ever!","The first 2 trailers were bad, but this one wow awesome","Who came after watching thugs of Hindustan ?","who came here after watching thugs of hindostan trailer","Came here after watching thugs of hindostsn trailer","Captain Jack Sparrow😘😘😘😘😘😘😘😘😘😘😘","When you get more pumped up for the trailer than the movie","I’ve always loved the music in this trailer.","The music is X Ray Dog, I’m sure of it. But which of their songs?","To not include 'Pintel and Ragetti' in \"Dead Men Tell no Tales\" was a crime.","This is actually the most expensive movie ever made. FACT","kingdom hearts 3 anyone?","Kingdom hearts baby!!!","This is just dead man's chest with extra scenes.","0:33 proof that the world is flat","BARBOSA IS THE BEST AND THAT LAUGH AHAHAHHHAA","2018????","Can't wait wait for Kingdom Hearts 3!","2:19 Lol Barbossa","The first 15 seconds of this trailer still gives me shivers","anyone know which movie was the one where they were hating for Davy Jones' heart?","the best series of my life... <3","This is my Star Wars","this movie man was it good! I loved Will. Happy that Will and Elizabeth got married. It was completely traumatizing for as a nine year old to see my favorite character get stabbed in the heart. That nine year old was holding back tears and wanted to stay away from it for about a long period of time now it's my favorite trilogy","This movie prove the world is flat","1:55 still gives me goosebumps <3","The grand finale of the incredible trilogy. This is the last Pirates movie BTW. Those new ones have the name but they aren’t Pirates movies at all.","but if I am not wrong BABOOSA was killed by JACK SPAROW in 1st part"]},{"title":"Spectre","comments":["Mamá Imelda Rivera was here?","Most ATROCIOUS movie series in the history of Hollywood","I’m only 14 and I love this movie and Skyfall","https://these-can-be-future-hollywood-movies.blogspot.com/2018/08/the-task-includes-james-bond-john.html","Spectre the best film","1:45\nWait... wait, wait, wait, is that... is that the goddamn OHMSS tune?","I don't stop to think about it .","Daniel Craig ist der Beste \" James Bond \" 🔥🔥🔥","Anyone else notice that they use a version of the theme from \"On Her Majesty's Secret Service\" in this trailer?","its a bad movie","The writing's on the wall is epic theme song for Spectre.👍👍👍😃😃😃","Ruth Wilson for Bond Girl!\nIdris Elba for James Bond!","daneil craig best bond ever","Awesome movie. Awesome actor. i met him here last month in the Philippines at City of Dreams Manila, he is good person. i know cause im the one who serve his food😁","gonna check this out","Man the opening of this movie was great, the rest of the movie? Well.......","The name is Bond................. James bond \n\n\n\n\n\nOO7🔫","It's not skyfall but i like it too","\"... no, I think I'll call you \"C\"","Cuckoo...","2019 is too long to wait!!","Love this trailer! 😁","My friends dont like James Bond... i dont know how is that even possible 😂","just watched it. shitty film","tom hardy","After following SKYFALL, it could not meet expectations unfortunately. Some people just can't enjoy a movie, without trying to analyse it.","Who else is watching Spectre only to see Batista?","Fabuloso como todo lo de Bond de James Bond.","This is a perfect as you can get! Better than Skyfall, maybe even Goldfinger. If this is Craig's last Bond film, I think they should've end the series right here.","why does this movie get so much hate, i loved it.","Great Movie recipe:  1) Coolest guy overcoming impossible odds  2) Fast cars  3) Faster women 4)  Iconic James Bond theme music to make the motion picture an instant classic.","This movie got a lot of hate mostly because it was \"classic Bond\". I honestly enjoyed it more than Skyfall since I had more problems with that film, but Bardem was the better villain. Mendes excelled at making these latest 2 look beautiful. For Craig my personal ranking is Casino Royale > Spectre > Skyfall > Quantum of Solace","This trailer was better than the whole movie (movie was averagem, not bad, of course).","The split second at 2:15 is pretty much all I came for. I had to put it at 0.25 speed.","Décevant !","It's 2016 and NAZIs are still the bad guys?","I love you Daniel Craig💋","This was not even half as good as Casino Royale. Martin Campbell + Craig would make better films than Mendes. This was a waste of money. Sam Mendes nd production messed up 2 bond films basically. Brosnan is best, Craig could have been a lil more suave if he had a better director than Sam Mendes. Very dissappointed with the last 2 films. Looking forward for Bourne.","Count how many Sony products there is in this movie, it's almost abit to much. Or make a drinking game out of it, tv screens and smartphone's everywhere and it's only Sony products.","I love this movie!","but this movie isnt as awesome as it looks coz i've watched it","this is like part 2 of skyfall","I think he is the best +BOND","I went to watch this with my class and another class from my school and we invited our English teacher to come but she couldn't, and it's good she didn't come because we made a whole mess in the cinema and when we told her she is like thank god I didn't come because she didn't want the staff to know we were with her haha","BOND IS A PATHETIC SPY WHO HAS TO DEPEND A LOT ON SEX TO SELL HIMSELF ...LOL !!! BOND SHOULD LEARN A LOT FROM JASON BOURNE, WHO CAN KICK BOND'S ASS ANY GIVEN DAY !!!!!!!!","Hells teeth Monica Belluci still has it...","If there's lea seydoux in a movie then it's a must to watch.","Sanskari james bond","The best this clip made me do is Play Asphault!","hey!\n    Batista??"]},{"title":"Star Wars: Episode VII - The Force Awakens","comments":["Awesome !!!","0:14","Star Wars!!","my birthday is on the star wras","I saw this trailer on TV on  Film 4 whilst watching EPISODE 5","this TV spot makes me wanna go watch it again","llove star wars","Wooohooo","switch spoiler deflectors too double front !!","to much spoiler","BB-8 is beach ball😂😂😂😂","BB-8 is beach ball😂😂😂😂","Was amazing!","\"You might need this.\" \"I think I can handle myself.\" \"That's why I'm givin' it to ya.\"","Why is this Tv spot called \"secret?\"","TR8 T0R","Can't wait for episode VIII when Luke says \"Rey I am your father\"\nAs Luke has very possibly gone over to the dark side.","A.P.C.S.","\"BB-8, roll on!\"","I'm so glad and I DO NOT REGRET watching this TV Spot AFTER watching the film.","Awesome Movie! I really love the BB-8 and the entire movie! Congratulations to director, actors, actresses, and all film crew. I hope 2017 arrives at the speed of light.","This is my favorite one.","Star Wars is for children essentially. Yes it has many adult themes and the story is complex and dynamic but it's children that will enjoy Star Wars the most, which brings me to this realization. If Star Wars doesn't make a billion dollars on it's opening weekend then there are millions of parents that hate their children.\nStar Wars is a gift to children all over the world. Star Wars is a -pledge to children that there is something in life worth believing in, worth struggling for, worth having hope for.\nThe parent that denies their children this exciting, moving, unique movie truly has hatred for their child. You may not fully understand or be unwilling to realize this but it's a sad truth.\nEvery parent should be spending their weekend taking their children to the cinema for this once in a lifetime event. This is an extraordinary event and for a child to miss this is the most humiliating thing you can do. This particular showing of Star Wars will be seen by millions of people and will be talked about at work, in social gatherings and at school.\n\nIt is a cruel thing to do deny your child this film this weekend.","dem good for me for not watching this trailer/tv spots whatever you wanna call it, spoiler trailers! i had so much fun watching the movie! i shouldn't have even watched the first trailer. i should have gone in total darkness. ill do that for episode 8!","SPOILER ALERT (kinda)\n\nThat guy had a rebel alliance sign. New empire? Led by Luke?","did a Disney movie have a character say \"hell no\"","(SPOILERRR)-U HAVE BEEN WARNEDDDD!) R.I.P Han Solo :( It kinda ruined it ( FOR ME ) That Han died..He was my favourite character after all. I just hope he's alive...Please be alive!... :(","He has no arms you jerk😠","SPOILER!: \nLuke is the Sith Lord","Yavin 4?","you feeel this ?\n\nthis is a feeling i haven't felt for a long time\n\nstar wars is back","British accents ruin american movies.","I'm already liking BB-8","BB8 couldn't hold on","Does that storm trooper have a cog rattle?","0:08 Jonesey? Hey... Don't take stuff like that out of temples! And if you do then remember it belongs in a museum!","0:22 a black person saying hell no.","December 17th can't wait!","0:25 The Stormtrooper could just turn arund and shoot him in te back :D","Afghan old sogs","''Hell no'' There is a hell in the Star Wars universe?","How do you get a storm trooper outfit they are so cool","Kylo Ren was Luke's apprentice, and Finn dies by Kylo's sword.","That Rey is kind of cute for a dude","I can see Rey getting a saber staff. Am I the only one","hey it's supposed to be pg like the other's from episode 4-6.","This trailers better but I wish they adapted the theme song to fit today's times","Jar jar binks is the sith lord","That dude has got to be the least confident guy in the whole saga","That ending part was so boss. How the storm trooper just flicked it and it spun around :D"]},{"title":"John Carter","comments":["Still waiting on JC2","No matter what people said, I really love this movie","this movie was amazing!","You may the only one who can see us..","Performed by Peter Gabriel perhaps but the original version is by Arcade Fire. ","I Like...full...!!","Unique !","A brilliant family adventure film... Don't believe the critics hype!","Flash! ahhh ahhhh ahhh","I loved this film! Wish there would be a sequel!","Barsoooooooooom....","Best film for years. Much better than Avatar and even Flash Gordon (though the original is the best - the old 1930s version with the actor Charles Middleton as Ming the Merciless is impossible to beat)...","I don't care if it's under rated.... it entertains me ","I know marketing was bad but I cannot thank them enough for the pleasant surprise I got when I watched it. Most movies are spoiled by showing the best bits during the trailer which winds me right up.","Masterpiece !","Masterpiece ! I just want to say I never review films but ... I can't see this film fade due to poor marketing . For me\nThis film is 10/10 the production , story, cast and graphics are simply amazing , + 1000 for the sequel but this time Disney market the film properly so we know how good it is going to be !","i'm with u on that","I desperately want a sequal to this movie, so I'm buying the dvd or bluray! Who's with me?\n\nPlease make the trilogy!","Bu film bi harika dostum o.O\n","Fantastic! Way to go disney!","Well since Disney now own Marvel they could make a planet hulk movie...mean look at this its epic visually and story it could work","They said the same thing about Chronicles of Riddick and we're getting a new movie now. So never give up hope and buy the DVD!","very great movie hoping for a part 2","Yeah, but it's based on a book that was published in 1912, so if anything Star Wars is like the Edgar Rice Burroughs Novels. ","Lol, two moons. Just reminds me of the Colbert line \"Yeah, how do you explain that?\" [The Moon] \"How come we have that and Mars doesn't (except for the two that it does)\"","well have you seen star wars? This is ALOT like starwars, the ships, alians, flying cities  (jaba the hutts palace) the arena when he fights the white monster, from the original star wars when anakin, obi-wan, and pada`me have to fight the 2 beasts and there stuck on the pillars, yeah its alot like star wars.","now that disney owns rights for lucasfilm, some people are skeptical about disney having any success with star wars, well this trailer shows you disney are capable of the impossible, prepare yourselves!!","this movie was soo amazing ","i think the lead actor is cursed. the other film \"battleship\" wherein he was also lead actor, pretty much bombed as well.","whats this song?","Love how the film stays true to the book in the sence that the story was written by John Carter himself and given to ERB to publish.","isn't he the same guy who did battleship? whats his name?","The movie was awesome, i read the book and i really liked the movie.","this movie wasn't THAT bad, it was actually kinda funny. \"Virginia, SAK.\"","Are there any versions of this trailer that have the actual Arcade Fire song? I remember watching it when the movie came out and none of them were Peter Gabriel... what happened?\n","This movie was so much better then avatar","This was awesome! Dunno why critics gave it such a hard time.","The music is \"My Body is a cage\" by \"Peter Gabriel\".\n\nThumbs up to let people know ;)","I read the book, Princess of Mars when I was about 12. The film is almost true to the book. I suspect its just out of copyright?  I enjoyed the film, but then i have read the book at least 10 times over the years.  The book is one of a series of 10. very easy to read and enjoy. Not deep or complex, just good fun.\n","Horrible choice for leading man, but the movie is a dream. Watch it.","Zodanga","It came out earlier this year not last year.","Tim riggins!!!!","can anyone tell me what the name of the \"walking city\" was called in the movie? i just cant remember D:\ni need it so i can take the pictures that i find, and make a replica on minecraft.","Underrated movie sadly","This trailer does not do the movie justice. I was very skeptical about watching this movie but after reading all the good comments about it (which is where I actually get the real reviews) I decided to watch it. This movie was AMAZING! Way better than expected! Thank you youtube comments! You never let me down :)","Damn Jarsoom! I like Barsoom","love the sarcastic comments","The reason why it failed is because everyone is sick and tired of alien movies. Its like every single movie this summer had an alien in it. Its not cool anymore","Just recently watched this movie. I absolutely loved it! as a fan of the original story I thought this movie represented the books very well. I desperately want to see the story continue and tell the rest of the stories."]},{"title":"Spider-Man 3","comments":["I like spider man 3","spider -man4","2019..and still waiting for spiderman 4 🙁","I was working at my movie theater back in 2007.  The TV's in the lobby would show this preview every so often.  I would always drop what I was doing and watch it lol, got me so excited for the movie.  Then I saw it :(\nOh well, I will always have the memory of being excited for the movie.  God I miss 2007","PERFECTO ARÁCNIDO :P  YO LO AMO :P (EL SPIDERMAN DE TOBEY Y EL SPIDERMAN DE  Andrew Garfield, HAN SIDO LOS MEJORES)","Leider endet da schon die Saga❤️🔥","This could be the end of Spider-Man! And it has ended, last movie of the Raimi's Spider-Man. 😑","2019?😉","Still to this date,i feel goosebumps for last few seconds of this awesone trailer","This the Best movie of Spiderman,!!!!!!!! Spiderman 4 please!!!! The New Spiderman (Tom Hooland) 🤮🤮🤮🤮\nSam Raimi the Best!!","It’s always pizza time!","2018 and still watching","2018 December","This Spiderman will kick that nutsack chin of the mad fucking titan","I miss you Tobey","Well he was right It was the END of Spider-Man","Pretty sure they didnt put Venom in the trailer i think because they wanted to suprise people when the Comic Book villain Venom","2018and wating spider man 5","Pizza time","This really did give me a conclusion vibe. I’m kind of glad this is the end.","Spiderman triogly 2002-2007 Best Spiderman series in history, Forever....\n The Bad Spiderman, Spiderman Homecoming, even the amazing Spiderman medium series proved to be better than Spiderman's Homecoming, Spiderman Homecoming Worst","2018","Damn the music is so epic. I don't care what ppl think about this movie, I love it and it's my favorite of the 3!!","2018?","What an awesome Movie...","I remember that journalist saying \"This can be the end of Spider-man\" and be like: OMG THIS GONNA BE THE BEST MOVIE EVER! Watched 3 times in the opening weekend. Good times.","LMAO they used the 1998 Godzilla roar at 1:29","Spider-Man 1 (2002) vs. Iron Man 1 (2008)\nSpider-Man 2 (2004) vs. Iron Man 2 (2010)\nSpider-Man 3 (2007) vs. Iron Man 3 (2013)","omg I don’t know how there are some peoples that doesn’t  like this movie","I miss those days 💔💔 \nSpidey 😢","wait a sec venom?","IMO they shouldnt have spoiled the Sandman being the killer. Would've been a stunning surprise in the movie","Kille crog","1. Spiderman 2\n2. Spiderman\n3. Spiderman 3\n4. The amazing spiderman 2\n5. The amazing spiderman\n6. Spiderman homecoming the worst","venom.. reminds me of the one coming out in October this year...","#SpiderMan3","who is watching this in 2018?\nBtw maybe this movie is shit but this Spider Man will be always be my favorite","But this....\nDoes put a smile on my face.","1:02 SPIDERMAN: SYMBIOTE TIME!","🔥🔥🔥🔥","Awesome","Fackiu Adrew, this is my favorite Spiderman, my favorite 2 is Tom Holland :v","I was so thrilled when it first came to cinema,and the symbiote suit... Just Wow!","Peter: I didn’t kill your father \n\n\nAm I your father\n\nHarry: NOOOO","Sony vs Marvel ...","1:30 favourite part of the trailer","This movie came out 2 years Right before I had my vein Ruptured. And its STILL my FAVORITE Spider-Man movie!!!!!!!!","This film was 2007 When Spider-Man turns Black suit and use to against Sandman and Harry \nInto the suit transformación by Peter Parker this could be win by Spider-Man to save Mary jane from Venom  while they were fighting Venom's death.\nThe end of Spider-Man 3","love this a freakin lot","2018 anyone?"]},{"title":"Tangled","comments":["This trailer makes it seem like the main protagonist is Flynn, which i think was the original idea. But with the other trailers, they focus more on Rapunzel. Interesting...","Rapunzel: Fate.... Destiny....\r\nFlynn:A horse.","She couldn't leave the tower because of her evil adopted mother. This is pretty basic stuff here.","I was nervous going into this movie--It was Disney's first CGI prince-and-princess fairy tale movie, and I was expecting a Shrek look-alike, and was ticked at the title change from \"Rapunzel\" to \"Tangled.\"  Thank God I was wrong!  This is the best animated feature Disney has made since \"Beauty and the Beast\"!  The writing was beautiful, the self-sacrifice ending was beautiful, the main characters were gorgeous in looks and voices, and I'm going to buy the 4-disc edition of \"Tangled\"!","guessing most viewers are teens!","When does he marries her someone tolled me he marries her?","shes hot..","Just how much shampoo per shower does she need? ","Cute Movie","That Guy Is Cute && Funny. But I Still Want Thee Old Disney Bak. ","I guy who plays the guy in the movie is Chuck form Chuck I love that guy","your dream stinks! I was talking to her! ","i wana see this movie\n","when i first saw this, i though it was dreamworks......\r\ni hope this movie does well!","disney has changed soo much. From beauty and the beast to this. They are both fantastic. But i wish they would make another classic. That would be great.","disney has changed soo much. From beauty and the beast to this. They are both fantastic. But i wish they would make another classic. :(","disney has changed soo much. From beauty and the beast to this. They are both fantastic. But i wish they would make another classic. :(","it seems like his \"trusty steed\" turns out to be an enemy at 2:00 !","man people are still so negative today...all throughout the comments I just see people cringing that it MAY be bad...how bout just enjoy it like you would as a child? that way you wont be disappointed.","Go, live your dream...I will...Your dream Stinks I was talkin to her!","is she voiced by amy adams? cause she sounds like her","i want to watch tangled so much:)\r\n","wth iz wit da glowing hair?","y does it always have 2 be wat u ppl want u want a movie thats u like go make 1 and shut up this world that we live in is screwed up just deal with it","At 1:29 Oh no...NOT THE TOTEETAH! I HATED THAT EVEN AS A KINDERGARDENER!!!!!!!!!!!!","What you have to look out for is interesting plots (heck, they can even be the same plot as other films) but developed in an interesting way, and with (and this is extremely important nowadays) well-developed characters. You will know a story is good if the characters were interesting and deep, not some pretty or funny or ugly design which sings beautifully or makes bad jokes/hurts himself or is just plain evil because it is. Because people don't like that anymore, and neither do you. ","oh, please ppl, don't want disney movies to be like they used to be, quoting TheJuilewood: \"a classical, beautiful, emotional film\". That's just not what ppl are into these days, and you gotta accept that those types of films aren't even that good. But neither are bad animated comedies. ","look at repunzel in 27:00 shes a baby!!XD","Now I REALLY can't wait for this movie to come out! :D","13 people dont have a castle. ","kinda looks like how they draw Kim Posible....","Why did they turn this beautiful and extremely feminine fairy tale into an action flick told from the man's point of view??","i really hope there singing in it","no i want a castle\r\n","This trailer looks promising...to FAIL once again.","\"Go. Live your dream\"\n\"I will.\"\n\"Your dream stinks. I was talking to her\" :D ","why dont they just call it rapunzel?","Go live your dream\r\nFlynn: I will\r\nYour dream stinks,I was talkin to her","2:09 why is her hair glowing?","Something brought you here. Fate? Destiny? \r\nA horse? ","i wonder if there is singing in it!!","@Mozart003 that's exactly how I feel\n\nthis movie looks really promising I hope it doesnt let me down!!","ahhh i love disney although i miss the classic way of animation :(","main character is a rip off of tuliel from dreamworks ''eldarado'' cartoon. and the horse. they have the same mannerisms too. lame.","I can't stand dreamworks movies. I think the best recent disney movie was Enchanted and even that didn't have much cartoon. so sad..","\"head down.\"\r\n\"head down!\"\r\n\"arms in.\"\r\n\"arms in!\"\r\n\"knees apart.\"\r\n\"knees apart...knees apart?\"\r\n\r\nhaha look at Flinn's face <3","\"Go, live your dream\r\n\r\nI will!\r\n\r\nYour dream stinks. I was talking to her.\"\r\n\r\nCan't wait till it comes out <3","looks awesome i cant wait\n","here comes the smolder! love it! :))","Disney's Classics Quality for sure!"]},{"title":"Avengers: Age of Ultron","comments":["i dont know why im watching this right now","who came here after Endgame's trailer?","0:32 I wanna know who the woman in cave is.","Who was that in 0:33 fake scene","Anyone else just watching every marvel trailer while impatiently waiting for Avengers Endgame?","This trailer better then all, very beautiful. Guys from Endgame, hello!","Their Wil be avengers infinity war in 2018","Did he even get to watch it? :(","R.I.P. kitty0706","Ahh...... OLD MEMORIES","2019 anyone","I came here for kitty0706 in 2019 R.I.P","Still trying to figure out who that was at 0:32","2019?","The pinocchio remix is weird","who the hell is at 0:33 ?","\"We're in the Endgame.\"","0:33 who????? 😳","What's a song guys&","QUEM DE 2018?","here after infinity war","Here yours latest comment","They talked about the Endgame in this movie","We’re in the Endgame now.","When I watch of Gmod skits I always think about kitty0706 videos.\n\n\nR.I.P.","Somebody share the spiderman far from home trailer pls","This trailer gave me the chills","and we thought that this trailer was sad **cough cough** avengers endgame **cough cough**","R.I.P. Stan Lee 1922 - 2018 you will be missed.","R.I.P. Stan Lee and kitty0706","Ultron isn't scary when he talks. He should have been. Make marvel movies scary action! No humor or jokes when they fight! already saw with great boxxy software.","Müko :-)","Still the best avengers film","Ultrons voice is kinda scary cuz did he sound like that in the comics if stan lee showed you his voice in the comics","He,d love to see the movie \nYou know 😫😔😭😭😭😟😞","Who’s watching after infinity war","This might be my favorite MCU Trailer.\nAnd yes, I still want the 3 hour extended cut.","we will never forget you","Sooo cool!!!😬","K guys, I meant to write 'soooo cook's, sorry, thanks avengers fans.","Solo cool!!😀","RIP Kitty","Rip kitty0706","1:12","The comment section is 50% movie opinions and 50% rip kitty","I came to look at the comments saying dc movies were better than marvel movies\nPlease compare  infinity war to justice league( supposedly a good movie to dc fans)","WTF?! I'm reading comments how this movie should've been much darker. Are you serious?! Don't you hate DC for being too dark?!","The last thing Kitty0706 liked before he died","Hi","Kitty.....you will always be my favorite avenger....\n\neven if I just got to see your channel....i love your videos and if you are reading this wherever you are I hope you know that you made a lot of people happy and you did good\nRest In Peace Colin"]},{"title":"Batman v Superman: Dawn of Justice","comments":["Back when DCEU was lit. WB messed up pretty bad.","I remember how hyped I was for this :(","Yeah Doomsday and Wonder Woman do not belong in this trailer","daaaamn that was gooooood 2019 still the greatest","Shah Rukh khan as batman","Thas hot. Thas hot.","Best superhero movie trailer ever","I was so excited for this but so disappointed after seeing it.","\"It's time you learn what it means to be a man..\"\n\nI LOVE THAT LINE","I Love The Joker Reference!","Can't believe this trailer was a lot better than the movie","I just have a bad history with freaks dressed like clowns\n\n\nBut the joker in the dceu looks nothing like a clown","Who Else noticed that Robin suit is from Jason Todd","Happy 3 Year Anniversary","*HAPPY 3 YEAR ANNIVERSARY TO ONE OF THE MOST UNDERAPPRECIATED FILMS OF ALL TIME!!*","That’s a good trailer for a SHIT movie.","Still better than Captain Marvel.","Saw Captain Marvel today and that film isn’t touch the quality of BvS.  BvS visuals, score, and story is head and shoulders above Captain marvel. It’s insane this has a 27% on rotten tomato while Captain marvel is 80% and black panther is 90%+. Makes no sense.","Imagine if Batman used to kill and then he killed the joker but not before the joker turned Batman's apprentice into the new joker through torture. So Batman decided that from that moment on he will not kill because he killed his nemesis and still couldn't prevent him from turning one of the dearest people to his heart against him.","Disappointed 😔","At least they didn’t need to CGI Henry Cavil’s mustache in this movie!","2019 still gooseBUMP!!!","Ben Afleck is very atractive,but in this movie he looks too old for being batman","Wonder woman is a good movie but really this is better.","This a good movie But The Dark Knight rises is better. Man of steel is also better. Aquaman is also better.","I didnt watch this trailer when it came out. And when Wonder Woman comes out, I lost my fucking shit in the theater.","33 Reasons why Batman V Superman failed \n\n\n1. Jesse Eisenberg\n2. We have a vague understanding on why Batman hates Superman\n3. Jesse Eisenberg\n4. Superman has next to no reason to hate Batman\n5. Jesse Eisenberg\n6. Times Superman worked with the law? 0, 1/2 the world lives in fear, and times Superman trampled on Civil Liberties? who knows!?\n7. Jesse Eisenberg\n8. Times Batman harmed people? God Knows, amount of people living in fear of him? all of Gotham,  \n9. Jesse Eisenberg\n10. Why didn't Superman take ZOD'S SHIP a weapon from Kripton away from the goverment if he took down military satellites trying to track him. \n11. Jesse Eisenberg\n12.  Why does Lex hate Superman? HIS MOTIVATIONS ARE COMPLETELY BACKWARDS!!!!!!! AS HE HAS CONTRACTS TO REBUILD EVERYTHING HE DESTROYED!!!!!\n13. Jesse Eisenberg\n14. Why does Lex make Doomsday if he sees Superman as dangerous? Doomsday is like 10 Supermans with a fist for a brain\n15. Jesse Eisenberg\n16.  Why does Lex make Superman kill Batman!? If Superman looses what happens to Doomsday!? As he is still beaing made\n17. Jesse Eisenberg\n18. Wait Lex Luthor combining Kriptonian DNA with his own to make an ultamite killing mashine!? THATS NUCLEAR MAN!!!!! OH MY GOD ZACK IS GETTING INSPIRATION FROM THE WORST SUPERHERO MOVIE (Before the DCEU movies) EVER!!!!!! SUPERMAN 4!!!!!!!!\n19. Jesse Eisenberg\n20. The Martha scene\n21. Jesse Eisenberg\n22. The Martha scene\n23. Jesse Eisenberg\n24. The Martha scene\n25. Jesse Eisenberg\n26. The Martha scene\n27. Jesse Eisenberg\n28. The Martha scene\n29. Jesse Eisenberg\n30.The Martha scene\n31. Superman dies, in his second movie. \n32. Jesse Eisenberg\n33. ZACK YOU HAVE TO EARN SUPERMAN'S DEATH!!!!!!!!! YOU BARELY EVEN FOCUSED ON HIM!!!!!!!!!!!!!!!!!","The difference between the Ultimate Edition and the theatrical cut is that the theatrical cut is like a 2-hour series finale to a Superman live-action series from Zack Snyder while the Ultimate Edition is like the final 1-hour episode before the series finale and the 2-hour series finale to that same Superman live-action Series.","We didn’t deserve this!! Watching this and getting sad that we wont be ever So blessed to get a movie like this!!","After seeing this in 2019, I can only feel sad for what have we lost in Ben Affleck.","Who's here grieving over that we can never see this batman on the big screen anymore?","Thank god I didn’t watched the trailer. I screamed with joy because that ww entry was so badass the trailer would have spoiled it for me","WHICH IS THE SONG! SOMEBODY PLEASE TELL ME GAWDDAYME, IT'S NOWHERE TO BE FOUND","This trailer looks equally good as end game but the movie...","all the trailers are way better than the whole movie","#BoicotTheBatman2021 , no ben affleck,no watch the batman, box office 0USD...","3 años","The movie had poor reception due the last 20 seconds of this trailer. It gave away way too much plot details. Batfleck was the perfect Batman. He was just one good movie away from becoming the best Batman ever.","I hated this version of Lex Luther mainly because of the actor but i gotta say some of his lines are so damn chilling","If man won't kill God, the devil will do it.","When you watch the movie in the trailer...\n\n\n\n\nI'm suprised they didn't show superman die....","Lex Luthor looks young","the trailer that started WB's loss of trust and Zack. From this point forward, they ruined everything. The ironic thing is that it was their idea to show doomsday all along. #releasethesnydercut you fools","Who's here in 2019??","I'm both a marvel and DC guy and this movie was awesome and good..the extended was best. The warehouse fight, boi","The only reason why dis movie’s bad is cause of WB. Zack makes....okay movies. But if WB wasn’t there, it would’ve gotten maximum 79% on rotten tomatoes","3 syllable word for any thought too big for little minds. So true","I admired Zack Snyder's work but I still disagree with his choice of Lex","Beautiful and the Best superhero movie ever, thanks Snyder for the trinity.","\"It's time you learn what it means to be a man\", damn!"]},{"title":"Superman Returns","comments":["This was the best superman movie. I'm not a superman fan but i enjoyed this","Best Superman movie ever!","FROM MR AWESOME 1 MR WONDERFUL 1 MR SUPERMAN 3BC1","I was like what Ray is Superman?!😂","I never knew that atoms alter ego was superman","This is one of my favourite superman movies","Barry created Flashpoint and now he is Ray Palmer. Way to go Flash","This is so weird seeing him as Superman after first seeing him as ray Palmer in legends of tomorrow 😂","When they attempted a Superman reboot with man of steel half a decade later fanboys and Feminists tarred it apart more than ever.","That eyeball deflect","Superman will nev.... WRONG","I grew up with Superman the animated series and Justice League but seeing BvS version of Lex Luthor was pretty unsettleing.","If they would let me. I could write the worlds greatest superman screenplay this world has ever seen. Just give me one chance. I promise it will be what all expect. I need one chance","when i first saw legends of tomorrow and Brandon as The Atom I thought brandon looked more like Superman/Clark Kent than Atom","Link film ???","1:53 Here start the meme","Shoutouts to my boy Ray Palmer","I never seen this before","I'm here because I thought the Atom looked familiar, like I've seen him in a movie","Fairplay but good ol' Spacey was an amazing Lex Luthor.","这个戏出了？沒有？上映了沒！","it's than coming soon","Who's here from the arrowverse?  Anyone?","Ray Palmer is superman?","This is superman 2006. Also if you had a chance to be the real superman will you take it","-_-","😔😔😔😔😓😓😓😢","Atom vs superman ","This was dumb all the way!","THIS IS THE WORST PIECE OF SHIT FILM IVE EVER SEEN OMG WHAT A WASTE OF FUCKING PAYROLL","I don't care what anyone says, this movie was great. If they would've just rebooted the franchise instead of continuing Donner's Superman movie, it probably would've been much better. ","Btw, I have this movie and I've seen this like 50000 times, lol.","Truthfully.... I always thought that BRUSE you know the guy who played superman In this, was kinda cute. And I'm 15 will be 16 this July 15th.... I mean, is that weird that I think he's kinda cute? Specially when I'm only 15? LOL! XD haha! There now everybody knows.","Is this the real trailer or fan made? I don't remember. A lot of people shit on this movie but it is the bridge between the 1978 version and 2013's man of steel.","I think besides the whole Bryan Singer making this too gay for even gay people....so sad so sad.\nThe problem with Superman movies and this one...is who is ALWAYS the god damn bad guy more times then not...LEX LUTHOR.\nWith all the many great villains Superman has WE NEED TO SEE more bad guys for him to fight. Hope MAN OF STEEL begins that trend.","@Henry Roth","he looks so cg im seeing the new one next summer","wonder when theyre going to make a Justie League","There was no problem with this movie. It's 6 yrs later and I've seen this movie plus all the originals more than 15 times altogether. Super fan. Any way, after watching the originals a few times again, I realize that the original 2 movies with christopher reeve were the best, the other two made no sense and never tied in with the plot line. Some of you complain about how the movies were wierd remake things, but I think this movie was the best way of closing it.","I liked this film. Kevin Spacey was phenomenal as Lex Luthor and Brandon Routh was a good choice for Superman.","im sorry this movie wasnt that bad it was pretty gd..need more action but other then that they had to intoduced the chartars again..i like this movie sorry but then again i like the christopher reeve movies...","stupidest superman movie next to that awful richard pyror one. at one point superman is lifting LIFTING  kryptonite with his bare hands.  A MOUNTAIN OF KRYPTONITE  cutting into his hands . anyone who says this was a decent superman movie does not really know the true superman mythology.\n","Gauge his smile...-faints :P","I liked this movie, but I don't know why Bryan Singer left X-Men to do this.","Despite all the criticisms, I thought this was a quality movie.  Could it have been better?  Absolutely, but for what it was, I thoroughly enjoyed it and am looking forward to Man of Steel.","This was the FIRST trailer for \"Superman Returns\" I ever saw.  Since then, I've only been able to find teasers & other different theatrical trailers on the net. I'm SO happy this particular trailer has finally been uploaded.\r\n\r\nAnd I gotta tell you, back in late 2005, the feeling of seeing footage for 1st time of the first new Superman movie since 1987's \"Superman IV: The Quest For Peace\"...could only be summed up in 2 words: ABSOLUTELY BREATHTAKING! \r\n\r\nI Love This Trailer!  I Love This Movie!"]},{"title":"Quantum of Solace","comments":["Camike Cinemas","Trailer awesome movie sucked.","Underrated Bond Film. Fight me.","Titob","When James Bond is becoming Jason Bourne","they didnt have to kill lynd i loved every bit of their conversation with bond","..and it was one of the worst Bond films. Worse than even Die Another Day.","I still hate that they never used this badass visual of James Bond strolling through a desert suited up with shades on packing an UMP-9. Badass.","official trailer my ass","DECIPLES OF LEEDA","I wonder where the shot of Bond shirtless at 1:35 would've fit in the movie if it wasn't deleted. In that shot he's wearing jeans and in a hotel room that looks a lot like the room where Strawberry Fields was found dead by MI6. But the only times he wears jeans in the movie is after M places a capture-or-kill order on him. He would've had no time to change in the hotel or anywhere near it with people trying to hunt him down and kill him. Maybe it was a scene where he gets dressed in another hotel room getting ready to talk to Felix Leiter on the phone?","The Bond Supremacy","0 :57 To 1 :01!","I saw this in the cinema, but I can't remember a damn thing about it. Ouch!\nNevertheless, I loved the trailer. Legendary then, legendary now.","Best one","I liked it , not as bad as people said.  6 out of 10","Think this is the only Daniel Craig Bond movie I somehow skipped and never got to it.","Worst Bond Ever. Connery, Moore and Dalton are the only ones worth considering.","trailer was so good but the movie was so Bad","An interesting No the movie is not as good as Casino Royale Skyfall and Spectre","awesome.","Loved it... loved every Daniel Craig bond movie","Honestly, after watching Casino Royale, you can skip right to Skyfall, because this film does nothing for the series. It wasn't a story that needed to be told.","Cool Beans!","Worst Bond movie.","\"007 #Action","Sam Mendes? C'mon. When I imagine him directing this movie i conclude as: BORING!","Not so hard to fix this movie.\nhttps://stopdrinkingthekoolaidblog.wordpress.com/2016/07/27/rx-quantum-of-solace/","8 fucking years ago.... Daniel Craig you will be missed","I love James bond movies, I saw spectre, casino total and quantum of...","it was pretty good to me about, a 7 on a scale of 1 to 10","Compared to Spectre, this is a masterpiece","1:36-1:42 Best part of the trailer","God this trailer is so fucking amazing and they shit the god damn bed. Skyfall was great though. I just really wanted a great follow up to Royale.","Best to watch this immediately after Casino Royale as it's really the only \"sequel\" in the Bond franchise.","Looks like James Bond's evil twin.","What a great trailer this was.","can someone plz tell me why he wanted vesper's boyfriend\nhe wasnt responsible for her death..right????","was quantum of solace after Casino Royale or before\nsry","I think this one of the better edited trailers, the way the scene reverts to Bond in the desert and finally submits itself during the title reveal is pretty cool.","Am I the only one that actually liked this movie?","Better than Spectre.","Anyone know the track at 1:08?","Killer walk by bond","QOS ws a reall bad ass bond! Fast and jst brutal ! Loved it =)","inconsolable rage!!!!!!!","Pretty sure I've seen this movie but I don't remember a damn thing about this one ","Ugh the trailer was so good but the movie was so mediocre","Wait, Bond shot first.","Does anyone know this particular rendition of the james bond theme?"]},{"title":"The Lone Ranger","comments":["Johnny Deep as Tonto? Really? Thanks, we'll move on to something else.","It would have been cooler if they had the l\nLone Ranger and the Indian start out as teenagers.","Great !","Johnny Depp is wicked sick...\nthumbs up!!","Makes me want to play Red Dead Redemption.","Just FYI, I live in Creede where part of the Lone Ranger was filmed.  I met Johnny Depp and he was one of the nicest most considerate persons I have ever met.  There was no ego at all that was displayed.  Also, this day and age he is one of the most talented actors going, look at all the different roles he has played.  Maybe reconsider your thoughts.","Helena bonham carter and johnny deep well its sweenty toad all over again.....wait arnie hammer.","epic flop","ok, they bearly showed anything of trigger. the lone rangers white horse. and my favorite character from the old black & white show. back then, they had alot of focus onm the scenes with hias horse. its clear disney lost its edge on making a movie more funny. i would expect trigger to have some funny parts. but in this preview, u dont even see him till da end with the lone ranger sitting on his back, and might i add, not even facing the screen. the real hero isn't getting any screen time.","Nicee.....","I love just about everything Disney. I guess it's just the kid in me.","looks like a gud film\n","I would tell you: GO TO HELL\nBut I'll be more diplomat. My dear friend, I pity you to have such a primitive and unjustified point of view blinded by jealousy (maybe), in front of the HUGE spiritual talent that is Johnny Depp. Go to see some movies of his filmography like the Brave, Gilbert Grape or Edward Scissorhands. Only the bastards don't change their minds. ","Will it have blood or fireworks, Disney? :D\nYou know, western, bullets...\n","they have blood in a disneey movie thats a first","Jerry, Johnny and Hans again!!","Johnny Depp is the my favorite actor. Hands down....","The once grand American western, as great  as it once was, is ruined. Anti-heroism found in every protagonist. Scruffy beards bearing the face of the once clean-cut, respectable cowboy. Cheap mellow drama. Actors overdoing their fake accents to the point of extreme absurdity, they sound more western with no accent. And the icing of the cake being the regular sights of Gatling guns, dynamite, and small arms that had barely lived a month. And now Tonto and the Lone Ranger will join it all. ","Armie Hammer for Batman!","whatever role he acts he is always wicked!!!! yeah!!!!","I hate Johnny Depp, he is a no talent actor.\nSingle dimensional acting and a super huge ego....ENOUGH !!!!","Jonny Depp fans ,you need to watch him in  \"The Libertine\" ,  you will understand  who he based Capt. Jack Sparrow on.   Off topic  \"Dead Man\"  is one of his best.","Well, at the very least this explains why Johnny Depp is not starring as \"Oz The Great and Powerful\"","long live Captain Jack Sparrow","i highly agree","should be cool","Good can't wait","when does te film come out?\n","Armie Hammer!!!","what´s the music? Please!","what´s the soundtracks? ´please","Johnny depp good","Goooo johnny u r great actor","Is it in Johnny Depp's contract that he won't do movies without Helena Bonham Carter?","Yeah..that's way He is one of the highest paid actors in Hollywood...","Yea I'm sure you're superb ","and of course helene is in this as well\n","Johnny u r just thr besr actor in the world. Keep working","Johnny Depp is mediocre at best.","In italian too: \"Tonto\" means \"Silly\" :)","Now see that would have been preferable to this.","That is also his nickname. My friends give me silly nicknames as well.\n\"Tonto\" also is about as heavy as \"silly\" in the spanish language.","yo con ver a armie martillo  y a juan profundo , me conformo, nada mas","SIA, as Keepers of the Comanche Culture, worked closely with Depp & the production crew/cast during the filming of The Lone Ranger in order to maintain sensitivity, authenticity & integrity to Depp’s portrayal of Tonto, whose character was Comanche. Stevens Point Journal 12/14","Don't get me wrong I love Helena Bonham Carter and Johnny Depp, but do they have to be in every movie together. Its becoming hard to differentiate between characters.","Johnny is actually 1/4 Indian (native american). And he actually lived 9 days with remaining Cherokees in Northen Texas to learn the role. I respect him for this one","Johnny Depp actually playing a role that is the same race he is. Nice.\n","This the 827th movie in which Johnny Depp stars with Helena Bonham Carter","I think he's 1/8th native actually","I would have liked to see Josh Brolin as the Lone Ranger - he's got a little more stature and toughness to him. He and Depp would have been kickass together."]},{"title":"Man of Steel","comments":["Brightburn brought me here!","The last ending track if the one I wanted to play when an exhausted superman uses the last of his strength to  fight Darkside, with that ending speach \"you just have to decide what kind of man you are going to be clark\"","2019?","I just love the music in this trailer. It’s just so intense and ... awesome","Masterpiece","snyder the king","Who’s here after seeing the bright burn trailers?","still a better trailer then shazam! was as a movie.","I just got here after watching Shazam.   What a turn of events tho","Man, I miss my grim and dark DC films.","The trailer was better than the fucking movie.","To be honest this was the only movie in the DCEU that really had my interest. It was a very well made movie. Batman vs Superman was not a true Man of Steel sequel. Aquaman and Shazam seemed to have redeemed DC though for the time being.","March 31 2019. The world was not ready for Man of Steel. Underappreciated Masterpiece. Had to go back to the trailer that got me hyped for this film.","cant believe how much years have passed already lmao i remember being so excited, MOS was a great film","The chills i got when i first saw this trailer are likely to never be repeated","Ryos6weisryo","i love or like all of the DC's movies since this film and including it, but this is the best one.","who is watching  in 2019 once again","this movie is perfect example of the before THE time. let it release today and it will break all the records. standard of the movie was way before its era,","It's 2019, and we're still ready! Ready for Man of Steel 2!","Gladiator music","Too good of a trailer","So much potential from this movie.... one of my favorite super heroes of all time... there should of been Greatness that came from this New DC beginning... but ... then we got Justice League.","damn this trailer made me so freaking excited for the DC cinematic universe but it went off a fricken cliff from here. fingers crossed for Shazam","Snyder mejor vete a dirigir a neptuno porque este planeta no esta preparado para tus peliculas .","Still watching in 2019. One of the greatest superhero movies ever made.","Am I the Only one Who is Waiting for Man of Steel 2 ?","MoS: Fathers\nBvS: Mothers\nJL: Family","2019 anyone ?\n2019 alguien ?\nDe los mejores trailers de la historia y de las mejores películas de comics","God knows why it is in my recommendations in 2019 😅","Why is this called offical trailer 2?????????","Your \"father\" was a tremendous coward, and more selfish than any antagonist could ever dare to be...\r\nMaking it a far less tragic thing that he died a moron's death. \r\nFitting for a life lived in fear.","2019?","2019 anyone ?!","My favourite trailer of all time !!","This movie is better than 85% of the mcu movies out there. Damn dc is so much better","3\n2\n1\n4","0110101101\nProperly\nSecure the area","2019 and this trailer still gives me the chills.","one of the best movies of the past decade, along with batman vs superman.","It's 2019,still this trailer gives me goosebumps","This movie will go down in history, as one of the most underated movies of all time. I personally love this movie, I've watched it at least 5 times and everytime i see it, there is always something else about the storyline that proves to me this movie doesn't get the credit it deserves. Like Jonathan Kent said, the world wasn't ready for this Superman.","I loved Man of Steel and i think something went wrong with the other movies. They just seemed off to me.","Came here after brightburn ❤️","Any one here after Brightburn Trailer","They should've just left it at this, no sequels or DCU. This was great in itself,","What an amazing movie!!!","Even  its 2019 i still  watching","The Birth of DCEU ✨✨✨","This film was really good for a stand alone Superman movie unfortunately they rushed justice league and Batman v Superman do to success of this film they should of continue up to 3 have Superman fight doomsday on 3rd movie die then introduce the jla members to fill in for Superman or something like that idk"]},{"title":"The Chronicles of Narnia: Prince Caspian","comments":["didier is a diddly poo salt lick devil","nice","Narnia is the best ever\n","Narnia is AWESOME!!!! If u love Narnia LIKE this COMMENT","Efek animasi binatang yang ditampilkan seperti yang sebenarnya dan tidak terlihat seperti animasi","0:47 - what's the title of this music? it's so nice :)","i find the movies kinda, meh. but they ares till good enough to be worth mentioning, watching, getting on DVD, that sort of thing."]},{"title":"The Avengers","comments":["This gets me excited for a movie I have already seen","Who's here after Endgame superbowl??","So, am I the only one who came here after Endgame's trailer?","This would have been 'The Protectors'","2019 anyone?","We’re in the Endgame now fans!!","who.s here from the avengers endgame superbowl trailer?","7 years later and I still get goosebumps at \n\nLoki: I have a army \n\nStark: We have a HULK \n\n*Hulk going apeshit! Perfect.","whos here after endgame?","Who’s here from the Avengers Endgame Super Bowl trailer !!?","Memories....","Who came back from Endgame super bowl","Anyone here after Endgame Superbowl??","2019??","now who is here from the avengers endgame super bowl trailer?","Here after Avengers Endgame Super Bowl Spot!","Who's here after the avengers endgame super bowl trailer?","Who here afer ENDGAME spot","Here after endgame tv spot ! Marvel has come so far","Avengers 4 tv spot came here?","Who's waiting for the Endgame super bowl spot?","*2019???*","who is waiting for avengers endgame clip","2019 anyone?","Tomorow End Game Guys!!","Anyone else watching this in 2019 that’s waiting for the Endgame Super Bowl Ad?!?!","Avengers: End Game Super Bowl is Coming!!","So... The Endgame is coming next April, i`m getting old...","Im From The Future","Never quite realized the Hulk was missing when the tracking shot begins.","In a few days Avengers 4 trailer comes out\nWe've come a long way","Where is avenger 4??","Stan Lee's legacy of the American Dream Team. (1922-2018) Excelsior ⭐⭐⭐⭐","This super-bowl TV spot and trailer created expectations beyond describing and the movie exceeded them. Ussing boxxy software I found this movie.","على فكرة تطبيق tha mofe hpدة ليشغل العلامات بس","Dc:I have a Batman\n\nMarvel:We have an Iron man","I love you marvel AVENGERS ASSEMBLE","The Avengers have the best quad trilogy (Avengers 4) of all time","I'm feeling nostalgic about how nobody knew The Avengers would be good or even work. Man.. now I know now how Star Wars fans felt back in 77.","whats the name of the soundtrack to this trailer?","so why are these movies always in may","😮😮😮😮😮😮😮😮","Wow","It was such a magical moment when this movie came out.","Infiniti War ❤😢","6 years ago...","It’s time indeed Nick Fury. The time for Infinity war","Avengers is Marvels love letter to its fans.","#CoulsonLives","How many saw the soul Gem on this trailer?"]},{"title":"Pirates of the Caribbean: On Stranger Tides","comments":["2011 Vibes <3","nigga","Vaise ye scripts videos movies phle se tay hote h... Bnavati h...kalpnik adhar bhi h... Be real be practical..","Actually fiction... Preplanned predetermined concepts contents scripts... Full audio, visual graphics effects... Be real be practical...","This movie was ok but definitely the weakest one in the series","I suppose I would not have loved this movie as much as I did if I hadn’t grown up watching it. I was a kid when I saw it in theaters and, as a kid, I just wanted to see more Jack Sparrow and his crazy adventures. So I loved it.","I love this movie❤❤❤jacksparrow","2019","syrena :) was the best part of this movie","1. Black Pearl (10/10) \n2. Dead Man’s Chest (9/10) \n3. At World’s End (8/10) \n4. Stranger Tides (7/10) \n5. DMTNT (3/10)","Why all say that this is bad movie. It is really funny!","Pirates are my fayorite","0:04 jack sparrow breaks the fourth wall","Next time, put PG rating.","It's not pirates of Caribbean 4 trailer","I love this movie coz it has penelope cruz 😍❤️😘","This movie was bad. Well, at least worse than the others. Elizabeth is a way better female character than Angelica!","So this is the most expensive film in history... well that tells a lot about our world.","Pirates of the \"Indian\". Will be there be a series coming up ?","It’s always a good idea to quit while you’re ahead.","I watched it 2 days ago on TV ! Wow 😁♡","BEST","This movie needs Will and Elizabeth to be good!","Pirates of the Caribbean on stranger tides is a great move for a new beginning.","highest budget movie no 1","1:53 is that Sunny Leone?","Most people commenting that Will and Elizabeth should be on every POTC movies but lol this isn't about their story. It's about Jack. You can't expect they are the only person who's encountered with him. Gibbs and Hector are special case tho 🤷‍♀️","Elizabeth is missing😶","honestly loved this movie. The last one called dead men tell no tales was absolute shit","0:06 \"my name is\" JEFF","Is there part 4","Need more movies from this saga pls pls pls 💔","Salazar revenge","Amazing film did you know it was the most expensive film ever made","Dosent that girl pirate remind you of camila cabello?","Link please","“Did everyone see that? Cause I will not be doing it again” \nMe","Mermaids in Da house!!!!","Best movie ever😍😍😍","And the Pirates of the Caribbean 5 came out in 2017😂","Fantastic Sir","osm","In my opinion all were good besides dead man tell no tales","what type of rum is this","I like the way of his walking and talking.","Wie heb alle films gezien ik wel","I'ts  so elegant","\"Hello Girl And Boys...Or Whatever\" LMAO 😂😂😂😂","This is best Pirates of the Carribbean because i didn't understand 2 and 3 but 1 4 and 5 is perfect and sorry i cant writing english very good","By far the shittiest of the 5., the best is 1 then 5 then 2 and 3"]},{"title":"Men in Black 3","comments":["Thanos was in the last one and now Thor is in the next one...Hollywood is a strange place.","0:20 - 0:37 so what happened to this part. I couldn't find it anywhere","Lmao, never knew Thanos was in here.","_Men in Black 3_\n7 years later...\n_Men in Black: International_","Ahh it's rewind time⏪⌚😂😂","The good old days.\n\nAnd now thor and Valkyrie are on mission to destroy MIB series. K","Song 1:38???? Please i miss this!","Old but forever gold 😎✨","Thanos","Thanos is K","Hubiesen sacado la internacional","ZIP IT THANOS","萨诺斯","*I just came here to cleanse my eyes after watching the new MIB reboot trailer, don't mind me*","Superior trailer to the new MiB.","Esto es lo mejor de los mejores","I just luv it😘😘😘😘","Perfect Eyebleach after watching the new trailer","half of this trailer wasent even in the movie","MIB 4 trailer is trash compared to this","Who is here after men in black 4?","Young K: Tell H He should have gone for the head....","Who is here after MIB international trailer.","This movie was sooo good. I saw it for my 11th or 12th birthday it was amazing","Come on Sony, tell me that you put Will Smith on the MIB: INTERNATIONAL please","Who here after the Man in Black 4 trailer?","0:34 This is where the meme came from!","Who's watching in 2018/2019?","It's rewind time","Who is here After the MIB International Trailer","Who’s back after the New movie of MIB ?","Waaaaaaaaay better than MIB 4","Who’s here after watching the new mib international trailer","Who is come after watch #MIBInternational trailer I'm will Smith fan","Who's watching this trailer after watched <MIB: Intetnational> trailer?","*_who's here before see the crappy trailer of MIB : International ?_*","Thought I wouldn't like it but the movie genuinely made me laugh, great film 👍🏾","I think 🤔 is gonna be a Men In Black Film 🎞 series 15 Years After And Have a Reboot or Spinoff by Marvel Studios by Thor Ragnarok Thor & Valkyrie by Cast Chris & Tessa From MiB Agent H & M","It's almost 2019 and I just realized this movie came out","How did miss this hmm ? I though there were only 2","Hey i have a request to that please make the mib part 4 please i am waiting ....","Omg☻","i like this trailer, they kept the 1969 setting in the shade !","Josh Brolin appears in most of the time of the movie, unlike Tommy Lee Jones... appears just 3 secs in the trailer.","18th Century Columbia Lady with Sunglasses","Tourch Lady (Columbia Pictures) with sunglasses and MIB Accessory in trailer","Oh my God I remember being in middle school when this movie came out the funny thing is is that not many people knew about it it’s existence. They had no idea what I was talking about when I mentioned that there was a men in black 3","0:22 that alien never made it to the final cut.","flaco não aparece no filme isso foi uma trapaça!","Are there no worms in this one? I love the worms in the first 2. God darn it."]}]