[
  {
    "movie": {
      "title": "Avatar",
      "comments": [
        "I am sorry for you... The technology of 3D movie was ill-conceived and movie directors had no idea how human stereoscopic vision works... To make things catastrophic, James Cameron created the worst 3D movie ever... Yes, the Avatar was totally stripped of billions of stereoscopic specular effects making all the scenes as if they ware colored paper textures...\n\nTo completely confuse viewers brain he made the actors and the scene grow or shrink during a single take and there is not a single scene in which actors would have their original size...\n\nSo, it is 2019 and not a single person in the World has seen real 3D movie!\n\nExcept for me :-)\n\nI will be making some serious money on Indiegogo selling 3D vision equipment and the first ever real 3D movie...\n\nSee you there and all the best in your life...\n\nMathew Orman",
        "Good video",
        "This was the ONLY preview I needed to see. I swore I wouldn't watch another until it came it. I nearly ORGASMED when my wife and I watched it in 3D...yes she was sucking me Popcorn style. God but people are so rude to stare.",
        "Ahahahahahahahahahahaha!  You MUST be daft.  Titanic's \"story\" is so insipid that there aren't words to describe how painfully trite of a movie that was compared to Avatar.  And I, for one, consider it one of DiCaprio’s worst and most heavy handed performances… much due to the horrible lines he was given in that forgettable script.",
        "A box office success does not indicate quality of a film.  It indicates statistics like marketing, audience, time of release, and other factors.  Avatar was released just as Titanic was: In the winter, little competition, which led to repeat viewings.  Titanic, however, was far superior to Avatar.",
        "аватар гавно для пидоров",
        "What is this music? Source anyone?",
        "THE PLOT WAS A BIG CLICHE, NOW EVERYBODY SHUT UP AND ENJOY THE AMAZING VISUALS, I WANT TO ENJOY THE AMAZING VISUALS, FUCK.",
        "I really do understand you, but you can enjoy the movie if you don't care about the story too much, because the visuals are amazing.",
        "@haydenworley Actually, it's almost scene for scene a remake of the Don Rosa story \"War of the Wendigo\". Love subplot aside. Right down to the placement of key scenes like the bulldozer attack and the final battle."
      ]
    },
    "revenue": 2787965087
  },
  {
    "movie": {
      "title": "Pirates of the Caribbean: At World's End",
      "comments": [
        "1:55-1:59 time",
        "1:55 The time..",
        "There was a time they knew how to make movie trailers",
        "Trailer's better than the movie.",
        "Pirates of the Caribbean movie pettu anna",
        "Is there any scene of the movie not shown in this trailed ?",
        "a trailer from the old school",
        "1:55 is better than any of the sequels that came after this movie",
        "One of those trailers you keep coming back to.",
        "This movie was so bad oh god..."
      ]
    },
    "revenue": 961000000
  },
  {
    "movie": {
      "title": "Spectre",
      "comments": [
        "The name is Damme, Van Damme, Jean Claude Van Damme.😂😂😂😂",
        "Mamá Imelda Rivera was here?",
        "Most ATROCIOUS movie series in the history of Hollywood",
        "I’m only 14 and I love this movie and Skyfall",
        "https://these-can-be-future-hollywood-movies.blogspot.com/2018/08/the-task-includes-james-bond-john.html",
        "Spectre the best film",
        "1:45\nWait... wait, wait, wait, is that... is that the goddamn OHMSS tune?",
        "I don't stop to think about it .",
        "Daniel Craig ist der Beste \" James Bond \" 🔥🔥🔥",
        "Anyone else notice that they use a version of the theme from \"On Her Majesty's Secret Service\" in this trailer?"
      ]
    },
    "revenue": 880674609
  },
  {
    "movie": {
      "title": "Star Wars: Episode VII - The Force Awakens",
      "comments": [
        "Awesome !!!",
        "0:14",
        "Star Wars!!",
        "my birthday is on the star wras",
        "I saw this trailer on TV on  Film 4 whilst watching EPISODE 5",
        "this TV spot makes me wanna go watch it again",
        "llove star wars",
        "Wooohooo",
        "switch spoiler deflectors too double front !!",
        "to much spoiler"
      ]
    },
    "revenue": 2068223624
  },
  {
    "movie": {
      "title": "John Carter",
      "comments": [
        "Still waiting on JC2",
        "No matter what people said, I really love this movie",
        "this movie was amazing!",
        "You may the only one who can see us..",
        "Performed by Peter Gabriel perhaps but the original version is by Arcade Fire. ",
        "I Like...full...!!",
        "Unique !",
        "A brilliant family adventure film... Don't believe the critics hype!",
        "Flash! ahhh ahhhh ahhh",
        "I loved this film! Wish there would be a sequel!"
      ]
    },
    "revenue": 284139100
  },
  {
    "movie": {
      "title": "Spider-Man 3",
      "comments": [
        "bhai hollywood me aisi spider man wali movie ab nahi bana sakte",
        "Unos de los mejores trailer que e visto hasta ahora . Y la musica de fondo para que decir ¡🙌🙌",
        "One of the most subscribed channels in the world",
        "The last Spiderman and last super hero movie i watched and actually enjoyed. Good old days, where people gave a fuck about things like atmosphere, music, art, story line, dramatic real acting.  Nowadays these things are gone, super hero movies  are about cheeseburger and videogames 12 year old \"jokes\" for half brain dead and american brain washed zombie masses to laugh while shoving 3k calories of junk food in their bellies.",
        "I like spider man 3",
        "spider -man4",
        "2019..and still waiting for spiderman 4 🙁",
        "I was working at my movie theater back in 2007.  The TV's in the lobby would show this preview every so often.  I would always drop what I was doing and watch it lol, got me so excited for the movie.  Then I saw it :(\nOh well, I will always have the memory of being excited for the movie.  God I miss 2007",
        "PERFECTO ARÁCNIDO :P  YO LO AMO :P (EL SPIDERMAN DE TOBEY Y EL SPIDERMAN DE  Andrew Garfield, HAN SIDO LOS MEJORES)",
        "Leider endet da schon die Saga❤️🔥"
      ]
    },
    "revenue": 890871626
  },
  {
    "movie": {
      "title": "Tangled",
      "comments": [
        "This trailer makes it seem like the main protagonist is Flynn, which i think was the original idea. But with the other trailers, they focus more on Rapunzel. Interesting...",
        "Rapunzel: Fate.... Destiny....\r\nFlynn:A horse.",
        "She couldn't leave the tower because of her evil adopted mother. This is pretty basic stuff here.",
        "I was nervous going into this movie--It was Disney's first CGI prince-and-princess fairy tale movie, and I was expecting a Shrek look-alike, and was ticked at the title change from \"Rapunzel\" to \"Tangled.\"  Thank God I was wrong!  This is the best animated feature Disney has made since \"Beauty and the Beast\"!  The writing was beautiful, the self-sacrifice ending was beautiful, the main characters were gorgeous in looks and voices, and I'm going to buy the 4-disc edition of \"Tangled\"!",
        "guessing most viewers are teens!",
        "When does he marries her someone tolled me he marries her?",
        "shes hot..",
        "Just how much shampoo per shower does she need? ",
        "Cute Movie",
        "That Guy Is Cute && Funny. But I Still Want Thee Old Disney Bak. "
      ]
    },
    "revenue": 591794936
  },
  {
    "movie": {
      "title": "Avengers: Age of Ultron",
      "comments": [
        "He doesn't have the chance to watch this movie.\nHe doesn't have the chance to watch every other MCU movie afterwards.\nHe doesn't have the chance to mourn all the unexpected deaths of Thanos' victor.\nHe doesn't even have the chance to cheer and clap when the portals opened at the theaters.",
        "I know this is gonna get buried in the comments, though I am pleasantly surprised to see how many recognized this was one of the last things kitty0706 saw, but i just wanted to say, i saw avengers endgame today. After the movie, thought of him. Wondering if he would of liked it, wondering what he would of thought of youtube today, and thensome. Still thinking about you, about jewwario, about eddsworld, about a few other content creators that just disappeared around the same time of year. Miss you all.",
        "0:33 Okoye?",
        "0.32 ok who was that lady? Seriously? Okoye?",
        "I give my respect to this whole comment section that commented for kitty, sleep well man :(",
        "In a way Ultron did tear them apart",
        "Who was that at 0:32",
        "Someone literally just asked who kitty0706 was...",
        "I thought this movie was going to be super dark but it was a regular marvel movie",
        "Whose here after Avengers Endgame?"
      ]
    },
    "revenue": 1405403694
  },
  {
    "movie": {
      "title": "Batman v Superman: Dawn of Justice",
      "comments": [
        "man 2019 these movies made more mature then the MCU films",
        "\"The greatest lie in America senator, is that power can be innocent \"",
        "This trailer ruined the whole movie for me....Everything exciting was shown in this trailer. If they could have kept just the 1 comic con trailer it would have been fine, but why did they show us the whole movie in this???",
        "Isn’t Lex suppose to be bald and older?",
        "Marvel is best and DC is ......",
        "Civil war is a way better than this.An advice for you,work for marvel bcs dc is worst",
        "Ben Affleck is so much taller than Henry cavill",
        "Shows Batman, Superman, and Wonder Woman standing alongside each other.\n\nShows Batman v Superman title.\n\nSeems legit.",
        "Clark, journalist.\n\"I've been doing a lot of research and investigation into Gotham into this mysterious vigilante called the Batman. My ear is very close to the ground about his presence in Gotham.\"\n\"...Also, who is that guy? Who? Bruce Wayne? Does he live in Gotham. I'm a journalist. \"",
        "will miss you affleck"
      ]
    },
    "revenue": 873260194
  },
  {
    "movie": {
      "title": "Superman Returns",
      "comments": [
        "This film was okay, but it needed a giant spider. LOL",
        "Ray Palmer? Fuck Barry what have you done now?",
        "Best superman movie ever !",
        "This was the best superman movie. I'm not a superman fan but i enjoyed this",
        "Best Superman movie ever!",
        "FROM MR AWESOME 1 MR WONDERFUL 1 MR SUPERMAN 3BC1",
        "I was like what Ray is Superman?!😂",
        "I never knew that atoms alter ego was superman",
        "This is one of my favourite superman movies",
        "Barry created Flashpoint and now he is Ray Palmer. Way to go Flash"
      ]
    },
    "revenue": 391081192
  },
  {
    "movie": {
      "title": "Quantum of Solace",
      "comments": [
        "007 reporting on duty",
        "Camike Cinemas",
        "Trailer awesome movie sucked.",
        "Underrated Bond Film. Fight me.",
        "Titob",
        "When James Bond is becoming Jason Bourne",
        "they didnt have to kill lynd i loved every bit of their conversation with bond",
        "..and it was one of the worst Bond films. Worse than even Die Another Day.",
        "I still hate that they never used this badass visual of James Bond strolling through a desert suited up with shades on packing an UMP-9. Badass.",
        "official trailer my ass"
      ]
    },
    "revenue": 586090727
  },
  {
    "movie": {
      "title": "The Lone Ranger",
      "comments": [
        "Johnny Deep as Tonto? Really? Thanks, we'll move on to something else.",
        "It would have been cooler if they had the l\nLone Ranger and the Indian start out as teenagers.",
        "Great !",
        "Johnny Depp is wicked sick...\nthumbs up!!",
        "Makes me want to play Red Dead Redemption.",
        "Just FYI, I live in Creede where part of the Lone Ranger was filmed.  I met Johnny Depp and he was one of the nicest most considerate persons I have ever met.  There was no ego at all that was displayed.  Also, this day and age he is one of the most talented actors going, look at all the different roles he has played.  Maybe reconsider your thoughts.",
        "Helena bonham carter and johnny deep well its sweenty toad all over again.....wait arnie hammer.",
        "epic flop",
        "ok, they bearly showed anything of trigger. the lone rangers white horse. and my favorite character from the old black & white show. back then, they had alot of focus onm the scenes with hias horse. its clear disney lost its edge on making a movie more funny. i would expect trigger to have some funny parts. but in this preview, u dont even see him till da end with the lone ranger sitting on his back, and might i add, not even facing the screen. the real hero isn't getting any screen time.",
        "Nicee....."
      ]
    },
    "revenue": 89289910
  },
  {
    "movie": {
      "title": "Man of Steel",
      "comments": [
        "#KeepHenryCavillasSuperman",
        "We desperately need a Superman movie where Superman has fun with his powers as Clark a bit and isn't like \"Oh no! I can fly, am super strong and invulnerable, the horror!\". So far, his TV adaptions were best. Lois & Clark + Smallville.",
        "This trailer got me in theater. The music, the cuts, just how everything was done so well and Kevin Costner. Superman i am a fan forever,  these are GREAT movies.  Music, special effects,  intent, emotion, dialogue not the greatest but we can overlook that. Superman I love you!!!!!!",
        "This trailer is way better than JL movie.",
        "The world is not ready for Zack Snyder",
        "Someone answer his crestions!!!",
        "This movie was great, some people were just determined to hate it, too bad for them.",
        "I wish the tone of the movie was more like this",
        "the official title for avengers 4 is endgame!",
        "And THAT'S how you start a movie universe."
      ]
    },
    "revenue": 668045518
  },
  {
    "movie": {
      "title": "The Chronicles of Narnia: Prince Caspian",
      "comments": [
        "didier is a diddly poo salt lick devil",
        "nice",
        "Narnia is the best ever\n",
        "Narnia is AWESOME!!!! If u love Narnia LIKE this COMMENT",
        "Efek animasi binatang yang ditampilkan seperti yang sebenarnya dan tidak terlihat seperti animasi",
        "0:47 - what's the title of this music? it's so nice :)",
        "i find the movies kinda, meh. but they ares till good enough to be worth mentioning, watching, getting on DVD, that sort of thing."
      ]
    },
    "revenue": 419665568
  },
  {
    "movie": {
      "title": "The Avengers",
      "comments": [
        "Anyone here after endgame😁",
        "WeloveYou3000",
        "7 Years ago today Everything we thought about movies changed",
        "Avengers Assemble! ♥️😔",
        "How Did I Just Find Out About This Trailer When Avengers Endgame Is Coming Out",
        "Can't believe it's been 7 years. And now I'm 2 days away from seeing Endgame.",
        "endgame",
        "Endgame is so close!😁😁😁",
        "This gets me excited for a movie I have already seen",
        "Who's here after Endgame superbowl??"
      ]
    },
    "revenue": 1519557910
  },
  {
    "movie": {
      "title": "Pirates of the Caribbean: On Stranger Tides",
      "comments": [
        "Miss jack!",
        "One of my classmates was doing a presentation of Johny Depp. originally, she was supposed to show only the first 45 seconds of this trailer, but we watched the entire trailer. Her presentation ended up being the best one.",
        "Good trailer.",
        "2:26 I always find it funny how they youtube poop their own movies in the trailers",
        "This movie is awesome \nWhy people hate this movies \nThis movie is total fun to watch",
        "I am big fan in jhonny depp (Jack sparrow)  ☠☠",
        "I love this movie very much.....",
        "2011 Vibes <3",
        "nigga",
        "Vaise ye scripts videos movies phle se tay hote h... Bnavati h...kalpnik adhar bhi h... Be real be practical.."
      ]
    },
    "revenue": 1045713802
  },
  {
    "movie": {
      "title": "Men in Black 3",
      "comments": [
        "I want to see Will Smith on the new movie I wish he will tho",
        "Who is watching this after  MIB INTERNATIONAL?",
        "Man,.. Boris used to terrify me",
        "2019?",
        "why'd they make a female version of 'men' in black, dont ruin the ultimate duo of will smith n tlj man",
        "Thanos knows the secrets of earth cause he's been an undercover agent all this time",
        "Who else discovered that Kay is the same guy that voices Thanos in Infinity War?",
        "1:45 THANOS is dat u ㅇㅁㅎ",
        "LOLLLLLLLL that goddess lookin' hella fly with those sunglasses and memory stick ㅅㅇㅋ 0:11 ㅋㅋㅋㅋ",
        "Why was the graffiti wall not in the movie? Also they changed the scene where K tells J about the secrets of the universe. In the trailer it is over the phone but in the movie it is in a restaurant. Also some dialogue was changed."
      ]
    },
    "revenue": 624026776
  },
  {
    "movie": {
      "title": "The Hobbit: The Battle of the Five Armies",
      "comments": [
        "''The Sacrifice of Faramir...'' hardcore fans get it",
        "Ini lah filem dajjal laknatullah, mcmni la nanti, alllahualllam 🏠",
        "I still like legolas tho, bitch is handsome",
        "Rip replay button",
        "This> GoT s8e3. Gonna rewatch hobbit and lotr to see some actually good writing as opposed to what game of thrones has become",
        "Watching this, wishing Season 8 of Thrones would've been two movies 😢",
        "The Middle Earth Saga:One last time.\nThe MCU:Whatever it takes.",
        "This was like 2014s endgame",
        "Am I the only one who thought about Pippin's Song - Edge of Night from LOTR: Return of the King when Podrick started to sing?",
        "Who’s watching in 2019 just because you rewatched LOTR and remembered pippin sings the song in the trailer from return of the king. I love it!"
      ]
    },
    "revenue": 956019788
  },
  {
    "movie": {
      "title": "The Amazing Spider-Man",
      "comments": [
        "Damm 7 years fucking love Spider-Man bro",
        "This in recommendations?\nSuspicious...",
        "Hello jerks why did you do it why did you cancel Spider-Man 4",
        "If it's proven that there are other universes in the MCU Multiverse, does that mean this and all the other Marvel movies out of the MCU are connected to it all?",
        "I believe that venom is part of the amazing Spider-Man univers so maybe after the deal btwn Sony and marvel ends they will bring to us Andrew as the amazing Spider-Man.\nI only hope that will happen.",
        "For every \"why is this in my recommended no\" just like this comment. Thanks",
        "2019 ???",
        "This movie is underrated, but it’s sequel is extremely horrible.",
        "2019?",
        "The best"
      ]
    },
    "revenue": 752215857
  },
  {
    "movie": {
      "title": "Robin Hood",
      "comments": [
        "Wth do ok movies like this get panned but bloody awful get lauded ffs???!!!",
        "Why is there a black guy in medievl setting ? Are people still so stupid to understand things like that kill the medieval feeling?",
        "Why is eggsy wearing a suit jacket in the middle ages?",
        "Good thing rocketman saved taron cause I wouldve been sad if this is what would've ended his career",
        "assasin's creed meets green arrow",
        "Why is jamie foxx a part of this movie cause you know the brothers were going hard back then. Pfff load shit.",
        "FIRE MOVie",
        "I might be the only one in the world who actually likes this movie...",
        "Pure propaganda,Moors never been to England,they portray English culture in a bad light but they praise the muslim one and most of all they shit on their famous longbow and use an arab bow.\nYes,our great Robin Hood uses and arab bow.\nAnother leftist/SJW movie,fuck it!",
        "ROBIN HOOD DIDNT HAVE A BLACK MAN IN THE ORIGINALS IT RUINS THE AUTHENTICITY , I THINK BLACK PEOPLE WOULD MAKE A BIG DEAL IF THEY REMADE BOYZ IN THE HOOD AND THERES WAS A FAT ASIAN LADY RUNNING THE GANG AND STREETS , OR A YAKUZA MOVIE WITH LATINOS BUT IAM AFRAID THE LUNATIC LEFT ARE PUSHING THERE PC AGENDAS !!!!"
      ]
    },
    "revenue": 73260114
  },
  {
    "movie": {
      "title": "The Hobbit: The Desolation of Smaug",
      "comments": [
        "First movie amazing second movie fucking epic third movie oh what happened Jesus Christ",
        "2019?",
        "What's the music in the background during the intro?",
        "I LOVE IT",
        "Love from India",
        "whoz watching this in 2019 ?",
        "holy shit, this movie turns 6 this year!! I remember freaking out over this trailer!!",
        "I miss this movie way back then when this movie came out",
        "2019",
        "They never make previews like this any more"
      ]
    },
    "revenue": 958400000
  },
  {
    "movie": {
      "title": "The Golden Compass",
      "comments": [
        "Retry and a TV series. Reading The Golden Compass right now and I’m in love.",
        "who is here after seeing the tv trailer",
        "This film is the irreligious opposite of Narnia.",
        "Anyone else checking this again after HBO released a trailer of their own.",
        "Armored Bear voices by Ian Fuckin' McKellen",
        "Trailer for HBO series of this movie. Just announced.\n\n\nhttps://www.youtube.com/watch?time_continue=53&v=0Qz8L4KaTss",
        "oh cmon, this adaptation wasn't so bad",
        "Roger Ebert gave this movie 4 out of 4 stars. He said it's superb. \nNo joke.\n\n\n\n\n\n\n\n\nRoger Ebert is an anti-christian!",
        "Demons inside case in this movie stupid people 😂",
        "Deep movie"
      ]
    },
    "revenue": 372234864
  },
  {
    "movie": {
      "title": "King Kong",
      "comments": [
        "King Kong 2005 > Kong: Skull Island",
        "wow thats a lot of white people",
        "2:13 Name of the song?",
        "one of the best movies ever made just crazy",
        "Such a good and touching movie... Peter Jackson is amazing once again",
        "Am I the only one that considers this a masterpiece? It has so much heart and emotion but still with lots of excitement! 3 hours never passes so quick\n(P.s the King Kong game was also a hot banger, which is again an unpopular opinion)",
        "This trailer is good",
        "2019 someone ?",
        "Great film but it takes way too long to get to the island wayyy too long boring untill they get there",
        "Insane movie"
      ]
    },
    "revenue": 550517357
  },
  {
    "movie": {
      "title": "Titanic",
      "comments": [
        "James Cameron is one of the best directors ever, this is EPIC",
        "Lol, the Trailer should start at the minute 3:11, instead of showing almost the entire movie but it's beautiful",
        "Is the real rose is still alive?",
        "I want to watch it so bad but I'M NOT STRONG ENOUGH and young Leonardo DiCaprio looks so cuteeee omg",
        "Love this  movie more and more thanks you  James Cameron",
        "Just watched it and was crying the whole time",
        "When I watched the movie I had a dream that me and my crush from school were on the time Titanic but we survived but when I woke up from th dream I was crying and I’m in fourth grade",
        "Very nice video",
        "I love the film so much",
        "Puri movie kyu Ni ati😡"
      ]
    },
    "revenue": 1845034188
  },
  {
    "movie": {
      "title": "Captain America: Civil War",
      "comments": [
        "After Endgame 🖐🏻",
        "2:06",
        "Who is watching the trailer after endgame 😁",
        "spider man spider man does whatever the plot demands",
        "Just trying to remember the highs and lows my heroes 🤧",
        "Who's here sad after endgame and remember these trailers and just everybody was so exited. Good times, and now can I not even watch endgame without crying..",
        "I still get goosebumps seeing Spider-Man in the trailer",
        "I actually never heard the news of the spider-man in mcu before seeing this so my reaction was more over the top then most ive seen",
        "2019?",
        "I'm still excited to see Spiderman"
      ]
    },
    "revenue": 1153304495
  },
  {
    "movie": {
      "title": "Battleship",
      "comments": [
        "I love the trailor",
        "A coworker just recommended this.........but Rhianna? Ugh ...might have to pass on it",
        "2:00 that's when things got real",
        "this is so great movie! I love the sounds effects",
        "this is my favourite Universal Pictures movie",
        "2019",
        "It revived the memory of how indian submarine was made to run by Pakistan army when it entered Pak territorial water .",
        "Future movies\n\nThe game of life the movie\nChutes and ladders the movie\nHungry hungry hippos the movie",
        "You guys... this movie was terrible ...",
        "This was poorly written. The acting was horrid too."
      ]
    },
    "revenue": 303025485
  },
  {
    "movie": {
      "title": "Jurassic World",
      "comments": [
        "I LOVE DINOSAUR PORN",
        "Today in 2 years the final movie from the Jurassic World franchise will be released! (11/6/19 - 11/6/21)",
        "I remember watching this in theatre but I forgot it's been almost 5 years!",
        "Wow 4 years ago?! Time Flies.",
        "Why is  Starlord working in a dino park?",
        "what i predict happens;\n- owen goes back on morag to look for the guardians, he doesn’t find anyone except yondu and gamora who both later die. All 3 of them look for the other guardians and milano and roam through the galaxies knowing that rocket drax and groot were in the trunk the whole time. Owen goes back to his title of star lord and calls doctor strange to create a portal so the dinosaurs could come to space where the team that was in space in infinity war can fight them instead of killing innocent lives on earth. Which exactly is spider man, iron man, nebula, drax, rocket, mantis, doctor strange and the other avengers to bash the dinosaurs out of existence leading to who was behind it all, thanos.",
        "YA’LL ITS THE KID FROM IRON MAN 3 YEAH IM LIKE 5 YEARS LATE BUT WHOS COUNTING",
        "Hi guys in every Jurassic movie you forgot one ancient strongest animal I don't know much about his existence but I love that animal its \"Dragon\" \nis it possible to add Dragon in the upcoming Jurassic movie with a new story?\nIt's just a request😁\nthis movie is awesome😍 I watched this movie and other Jurassic movies many times.",
        "Whos here after watching endgame and realising tony would have been still alive if this man.....",
        "Why the fuck is this in my recommended?"
      ]
    },
    "revenue": 1671713208
  },
  {
    "movie": {
      "title": "Spider-Man 2",
      "comments": [
        "It’s bad when all the trailers for this movie are better than the actual movie itself",
        "Puede que nos esté mostrando el trailer porque va a salir en la nueva película.",
        "2019???",
        "So sad this spiderman universe didnt get complete☹🤦‍♂️☹",
        "People say this suit is better than MCU Spidey but I swear every time I see this one I instantly think it’s a video game",
        "This trailer appeares in recommendations\nMmmmm...\nS\nU\nS\nP\nI\nC\nI\nU\nS",
        "After endgame dont know why",
        "You're trash Sony",
        "The trailer was more intense than the movie 😂",
        "I'm so excited for this movie oh wait"
      ]
    },
    "revenue": 705717432
  },
  {
    "movie": {
      "title": "Iron Man 3",
      "comments": [
        "Back when trailers used to spoil basically everything...",
        "Let's start all over again.",
        "You'll never see me coming....",
        "2019",
        "Bad slow motion effect",
        "Tony Stark lived a full life with Pepper and Morgan, and received the most meaningful death of all. Huh.",
        "Anyone notice the flip-phone at 1:57 turns into an iPhone at 2:04?",
        "I'm not after Endgame. I'm just here to watch movie trailers from 2013 unlike these like beggars after Endgame.",
        "Tony stark will miss you...🖤",
        "Nice."
      ]
    },
    "revenue": 1215439994
  },
  {
    "movie": {
      "title": "Alice in Wonderland",
      "comments": [
        "What the trailer doesn't tell you is that this movie is the definition of  A E S T H E T I C.",
        "I love Alice she was the best girl all children should look up to, she was and still my idol.",
        "I just watched the movie yesterday night 😂 I like how the movie is now then the trailer!❤️\n\n\n\n\n\n\n\nThe Caterpillar to me has some anger issues",
        "Easily the best Disney Classic with a female lead.",
        "Book was better than the 1951 film. The 1951 film was better than all of the later knockoff movies.",
        "Looks terrifying",
        "0:00-1:40 🎵Alice In Bibleland🎵",
        "I still love and watch this movie 🎥",
        "Yes",
        "Oh my gosh! Is this trailer being narrated by Walt Disney…himself!? Amazed doesn't even describe to how I'm feeling right now!🤩🤩🤩🤩🤩😲😲😲😲😲😲"
      ]
    },
    "revenue": 572000000
  },
  {
    "movie": {
      "title": "X-Men: The Last Stand",
      "comments": []
    },
    "revenue": 459359555
  },
  {
    "movie": {
      "title": "Monsters University",
      "comments": [
        "I LOVE THIS FILM!, I saw it at the cinema and it is amazing!",
        "I recognized the voice of MIke instantlly. Its the voice of actor from When Harry met Sally.",
        "The song playing in the background in the beginning is from the spongebob movie",
        "can't wait to see it!!",
        "<3",
        "I with you on that one! :(",
        "It's a good movie. So good I saw it 2 times.\nTrust me, It's better than it looks",
        "Roomates actually, Mike is the reason Randall is such a good scarer c:",
        "its a kids film  and they will love it and thats all that matters",
        "Pixar didn't check their facts on this film, in the original monsters inc film Mike said that he and Sully had been friends since fourth grade."
      ]
    },
    "revenue": 743559607
  },
  {
    "movie": {
      "title": "Transformers: Revenge of the Fallen",
      "comments": [
        "10 fucking years lol.",
        "This movie might be ass but you’ve got to hand it to the marketers. Shit like the first trailer not even giving you the title, and then both of them ending with the decepticon logo is top notch hooking material.\nHeck, even the title is cool if you ignore the in movie context. Without context the title of the movie can remind the average movie goer of another film by the name of Star Wars The Empire Strikes Back, or even Revenge of the Sith if you really want to go there. But honestly I think it’s trying to homage empire more given that this is the second film in the series.\n\nIt’s going for the same thing as empire, the big bad guy was defeated and the miguffin was destroyed, but that won’t stop the bad guys from wrecking shit up.",
        "1:42\n*MASK!*\n*PUNCH!*",
        "Transformers Animated superior, Transformers Revenge of the Fallen inferior.",
        "1:26 Best part",
        "This is the best movie i have ever seen❤️",
        "Look at this place, can you smell it,   Yeah is smells like 2009",
        "2019",
        "Before we seen the Fallen did anyone think that revenge of the Fallen meant revenge of Megatron since he was fallen as in died and got resurrected?",
        "this one made the most money"
      ]
    },
    "revenue": 836297228
  },
  {
    "movie": {
      "title": "Transformers: Age of Extinction",
      "comments": [
        "Hot dog's for dinner",
        "Cool",
        "El tráiler de TRANSFORMARSE la era de la extinción esta muy padre",
        "Being a Mark W fan, it's going to be a Really Good Movie, even Without Sam...",
        "Not sam widwiki but micheal bay",
        "@ 0:18, Strafe is carrying 2 beings. Presumably, Bumblebee & Stinger.",
        " \nDon't watch this movie.\nlame acting, lame action.﻿",
        "I'm going to love this awesome movie I just saw the commercial on TV just now I'm going to be so excited when it comes out😱",
        "Haha ",
        "No your good with the gun"
      ]
    },
    "revenue": 1091405097
  },
  {
    "movie": {
      "title": "Oz the Great and Powerful",
      "comments": [
        "as always, good trailer, shit movie, I dont like the way movie end up with 2 witch sisters. Like if you agree.",
        "Shut up Meg.",
        "Loved this film",
        "Song ?",
        "same director. ",
        "As nice as the trailer is, the movie was awful.",
        "This is the outcome when a director of action movie trilogy and a producer of fantasy movie get together xD Nice movie.",
        "beautiful",
        "Good move! Love it.",
        "I don't know why, but, everytime I see the face of James I'm thinking if it would there Johnny D. better"
      ]
    },
    "revenue": 491868548
  },
  {
    "movie": {
      "title": "The Amazing Spider-Man 2",
      "comments": [
        "It’s bad when all the trailers for this movie are better than the actual movie itself",
        "Puede que nos esté mostrando el trailer porque va a salir en la nueva película.",
        "2019???",
        "So sad this spiderman universe didnt get complete☹🤦‍♂️☹",
        "People say this suit is better than MCU Spidey but I swear every time I see this one I instantly think it’s a video game",
        "This trailer appeares in recommendations\nMmmmm...\nS\nU\nS\nP\nI\nC\nI\nU\nS",
        "After endgame dont know why",
        "You're trash Sony",
        "The trailer was more intense than the movie 😂",
        "I'm so excited for this movie oh wait"
      ]
    },
    "revenue": 705717432
  },
  {
    "movie": {
      "title": "TRON: Legacy",
      "comments": [
        "Impresionante banda sonora los felicito \"Daft Punk\"!!! ",
        "i just love these series",
        "The Tron:Uprising series is what this movie should have been like",
        "3D! it rocked me! \nGarrett Hedlund! aw :)",
        "i saw this movie high! It was epic! Best movie ever!",
        "That feeling when you return to your ordinary life after watching an awesome movie",
        "@stnathaniel \"The game has changed\", track 08 from the OST.",
        "Not too bad for a Disney movie. it plays the same premise as the original. The special effects and digital cinematography are entertaining enough to keep this film going. Plus, Olivia Wild is always nice to look at.",
        "whats the song that starts at 1:08?",
        "@ChalupaExtreme hmm not sure. reminds me of philip glass though"
      ]
    },
    "revenue": 400062763
  },
  {
    "movie": {
      "title": "Cars 2",
      "comments": [
        "So many Fiat Pandas, Audi TTs, and Peugeot 207s...",
        "I find this better than the first but it is still not that good ",
        "MATER was the only reason why i didn't like this movie.",
        "One of my favorite movies.",
        "I love this movie",
        "Omg that was so funny near the end when lightning saids \"Omg AAH\"",
        "As the end draws music from minute 1:53?",
        "i love you\n",
        "Sports car win over f1 car at f1 track is a joke, even though I love pixar's movie.",
        "This trailer is awsome."
      ]
    },
    "revenue": 559852396
  },
  {
    "movie": {
      "title": "Green Lantern",
      "comments": [
        "2:12 that asthmatic laugh haha!",
        "deadpool guy Ryan reynolds -  lets go back & watch this 👍        📞🤪           🆒"
      ]
    },
    "revenue": 219851172
  },
  {
    "movie": {
      "title": "Toy Story 3",
      "comments": [
        "Geez, Michael Keaton is in every movie now",
        "vi",
        "check this link behind the true story of toy story?\nhttp://moviepilot.com/posts/2014/02/24/the-true-identity-of-andy-s-mom-makes-toy-story-even-more-epic-1247874?utm_source=fb-stream-post&utm_medium=facebook&utm_campaign=the-true-identity-of-andy-s-mom-makes-toy-story-even-more-epic&subscribe_to=1247874",
        "All the men at the movie theatre cried at the end,and im not afraid to admit i was one of them",
        "A 4th will be in theater maybe in 2014",
        "@j04370859 Are they really making a 4th one?",
        "you guys notice that in every toy story, when they need to travel. they ride on the pizza planet car. in one woody and buzz, in two they all ride it to get the air port, and three the bear the clown and the baby find sunny side",
        "although i couldn't see it happening they are making a 4th one for a possible release in 2013. i'm not to judge if it's good or not since i've never seen it before so who knows",
        "i LOVE it",
        "All 3 movies were probably the best movies ever made. (oh, an Up of course.)"
      ]
    },
    "revenue": 1066969703
  },
  {
    "movie": {
      "title": "Terminator Salvation",
      "comments": [
        "I'm here after watching Terminator Dark Fate, wishing that they would've expanded the story of this movie #downwithfeminator",
        "The trailer was better than the movie!",
        "I wаtched Salvаtion full moоoоvie here https://twitter.com/39f3e0ca8580de6e2/status/887492618132766720",
        "t3 sucks",
        "Indeed. At least T3 was fun but T4, give me a break.",
        "This movie was still better than Terminator 3. Very underrated film. Great action scenes & decent effects\nThe decade 2000-2009 had so many underrated SCI-FI films - this one, Supernova, Mission to Mars, The Cell, Ultraviolet, Equilibrium, Cube 2, Sky Captain and the World of Tomorrow, Serenity, Signs, Hulk, Avatar (2004), Moon, Evolution, Pandorum, Push, A Sound of Thunder, Gamer, Resident Evil: Apocalypse, The 6th Day, The Box, The Fourth Kind, The Chronicles of Riddick etc",
        "Compared to T4 ? Nope.",
        "T-600 wasn't made later on, it appears in the movie.",
        "I know that... they should better write good story.",
        "I dare anyone here that watched this shiet more than Once, because the movie is so fucking senseless that it's impossible to watch it again, I hate it, and never consider it..."
      ]
    },
    "revenue": 371353001
  },
  {
    "movie": {
      "title": "Furious 7",
      "comments": [
        "No one : \n\nDom : one last ride....",
        "Hello",
        "Lollywood Beat Hollywood Soon",
        "1:20  uncharted 2",
        "Look it’s Chev Chelios",
        "FYI the director is James Wan,who also directed Saw,The Conjuring 1-2,Insidious and Aquaman",
        "If only Paul Walker was still alive.",
        "Dari 1 ampe 7 ikut terus",
        "Massa esse filme",
        "0.51 ong bak njir"
      ]
    },
    "revenue": 1506249360
  },
  {
    "movie": {
      "title": "World War Z",
      "comments": [
        "am i the only one in 2019 here?",
        "Anyone Hyped for the Game",
        "Osm movie",
        "one of the greatest zombie movies i have ever seen.",
        "when was coming world war z part 2?",
        "how to watch full movie",
        "Fuck You !!!",
        "This reminds me a lot of Fear The Walking Dead",
        "...BUZZZZZZZ!",
        "I <3 World War Z movie!"
      ]
    },
    "revenue": 531865000
  },
  {
    "movie": {
      "title": "X-Men: Days of Future Past",
      "comments": [
        "where can i get the info for the date of the event in Singapore ??!!!!",
        "Dat Accent Tho",
        "MAKE ELLEN PAGE COME TO SWEDEN IM BEGGING YOU PLEASE I'LL DO ANYTHING PLEASE!!!! I LOVE HER SO MUCH IM BEGGING YOU PLEASE!!",
        "im thinking i should go see this at iMAX  :D :D :O",
        "Best cast member =wolverine",
        "Jackman looks good with a mustache on too, seems he can pull of any facial hairstyle",
        "Why not malaysia? In fact singapore is close to malaysia.",
        " I Want  the  rogue ....",
        "can somebody take me to New York NOW please?!",
        "OMG SINGAPORE!?!?! xD YAY!!!"
      ]
    },
    "revenue": 747862775
  },
  {
    "movie": {
      "title": "Jack the Giant Slayer",
      "comments": [
        "i love these movie where is part 2?",
        "khá hay\n"
      ]
    },
    "revenue": 197687603
  }
]